Table of Contents
 Class IdeaCrossSectionByName
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaCrossSectionByName : AbstractIdeaObject<IIdeaCrossSectionByName>, IEquatable<AbstractIdeaObject<IIdeaCrossSectionByName>>, IIdeaCrossSectionByName, IIdeaCrossSection, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaCrossSectionByName>
IdeaCrossSectionByName
Implements
IEquatable<AbstractIdeaObject<IIdeaCrossSectionByName>>
IIdeaCrossSectionByName
IIdeaCrossSection
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaCrossSectionByName>.Id
 AbstractIdeaObject<IIdeaCrossSectionByName>.Name
 AbstractIdeaObject<IIdeaCrossSectionByName>.Identifier
 AbstractIdeaObject<IIdeaCrossSectionByName>.GetHashCode()
 AbstractIdeaObject<IIdeaCrossSectionByName>.Equals(object)
 AbstractIdeaObject<IIdeaCrossSectionByName>.Equals(AbstractIdeaObject<IIdeaCrossSectionByName>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaCrossSectionByName(Identifier<IIdeaCrossSectionByName>)
public IdeaCrossSectionByName(Identifier<IIdeaCrossSectionByName> identifer)
Parameters
identifer Identifier<IIdeaCrossSectionByName>
 IdeaCrossSectionByName(int)
public IdeaCrossSectionByName(int id)
Parameters
id int
 IdeaCrossSectionByName(string)
public IdeaCrossSectionByName(string id)
Parameters
id string
Properties
 IsInPrincipal
Specifies that the cross-section is in its principal axis.
public virtual bool IsInPrincipal { get; set; }
Property Value
bool
 Material
Material of the cross-section.
public virtual IIdeaMaterial Material { get; set; }
Property Value
IIdeaMaterial
 Rotation
Rotation of the cross-section.
public virtual double Rotation { get; set; }
Property Value
double
 Edit this page